Revit 2026 API

# DockablePaneState Class

---

Describes where a dockable pane window should appear in the Revit user interface.

SystemObject Autodesk.Revit.UIDockablePaneState

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DockablePaneState : IDisposable
```
```vb
Public Class DockablePaneState
	Implements IDisposable
```
```cpp
public ref class DockablePaneState : IDisposable
```
```fsharp
type DockablePaneState =
    class
        interface IDisposable
    end
```

The DockablePaneState type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DockablePaneState | Creates a new DockablePaneState object. |
|  | DockablePaneState(DockablePaneState) | Constructs a new copy of the input DockablePaneState object. |

|  | Name | Description |
| --- | --- | --- |
|  | DockPosition | Which part of the Revit application frame the pane should dock to. |
|  | FloatingRectangle | When %dockPosition% is Floating, this rectangle determines the size and position of the pane. Coordinates are relative to the upper-left-hand corner of the main Revit window. Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MinimumHeight | When %dockPosition% is anything other than floating, the minimum height to use for the pane. Default is 200 pixels. |
|  | MinimumWidth | When %dockPosition% is anything other than floating, the minimum width to use for the pane. Default is 200 pixels. |
|  | TabBehind | Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DockablePaneState |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetFloatingRectangle | When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace